BeautifulBeer/STM32_LAUNCHPAD/Project/launchpad/bluetooth/config_bluetooth.h
/*
 * config_bluetooth.h
 *
 *  Created on: 2017. 11. 24.
 *  Author: Kwanwoong Yoon
 *	
 */

#ifndef CONFIG_BLUETOOTH_H_
#define CONFIG_BLUETOOTH_H_

#include <stm32f10x.h>
#include <stm32f10x_exti.h>
#include <stm32f10x_gpio.h>
#include <stm32f10x_usart.h>
#include <string.h>
#include <stdlib.h>

#define BT_STR_MAX_LENGTH  				512
#define BT_STATUS_SYSTEM_UNSTART		0xF9
#define BT_STATUS_SYSTEM_START			0xFA
#define BT_STATUS_MUSIC_PLAY			0xFB
#define BT_STATUS_NONE					0xFC


/*
 *
 * This code implements bluetooth data transmission with android
 *
 * USART1(PA09 - TX, PA10 - RX), USART2(PA2 - TX, PA3 - RX) is used
 *
 * ATCommand List
 *
 * AT+BTSCAN
 *
 */

#define CR 0x0D //Carriage return
#define LF 0x0A //Line feed
#define BD 0xFF //Boundary
#define SD 0xDF //Data Start
#define ED 0xCF //Data End


//Initialize bluetooth configuration for transmission
void m_Init_Bluetooth(void);
//Initialize all configuration for usart1 transmission including clock enable
void m_Init_BT_USART1(void);
//Initialize all configuration for usart2 transmission including clock enable
void m_Init_BT_USART2(void);
//Initialize GPIOC configuration for USART1
void m_Init_BT_USART1_GPIOA(void);
//Initialize GPIOA configuration for USART2
void m_Init_BT_USART2_GPIOA(void);
//Initialize External Interrupt configuration for bluetooth
void m_Init_BT_USART2_EXIT(void);
//Initialize External Interrupt configuration for bluetooth
void m_Init_BT_USART1_EXIT(void);
//Initialize USART configuration for bluetooth
void m_Init_BT_USART(USART_TypeDef* USARTx);
//USART send string data until encounter \n (Maximum length is 512bytes)
void m_USART_DataSend(USART_TypeDef* USARTx, char* str, char buffer_[BT_STR_MAX_LENGTH] );
//USART send 2bytes including Synchronization
void m_USART_byteSend(USART_TypeDef* USARTx, uint16_t Data);
//Buffer Initialization
void m_buffer_init(char* buffer_);


#endif /* CONFIG_BLUETOOTH_H_ */
